Revit 2027 API
ParameterTypeId.RoomDesignPowerLoadParam Property
 "Specified Power Load"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RoomDesignPowerLoadParam { get; }
Public Shared ReadOnly Property RoomDesignPowerLoadParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RoomDesignPowerLoadParam {
	ForgeTypeId^ get ();
}
static member RoomDesignPowerLoadParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace